-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- 생성 시간: 19-04-29 21:37
-- 서버 버전: 5.5.59-log
-- PHP 버전: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `study421`
--
CREATE DATABASE IF NOT EXISTS `study421` DEFAULT CHARACTER SET euckr COLLATE euckr_korean_ci;
USE `study421`;

-- --------------------------------------------------------

--
-- 테이블 구조 `basket`
--

CREATE TABLE `basket` (
  `subject` char(30) NOT NULL,
  `num` int(11) NOT NULL,
  `price` int(100) NOT NULL,
  `number` char(50) NOT NULL,
  `id` char(30) DEFAULT NULL,
  `file_name` char(40) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `basket`
--

INSERT INTO `basket` (`subject`, `num`, `price`, `number`, `id`, `file_name`) VALUES
('[eat cook] \냉장 부�\��살 찹스', 3, 12700, 'ABC-20181115190238', '', '1000000911_detail_059.jpg');

-- --------------------------------------------------------

--
-- 테이블 구조 `faq`
--

CREATE TABLE `faq` (
  `num` int(11) NOT NULL,
  `subject` char(100) NOT NULL,
  `content` varchar(1000) NOT NULL,
  `file_name` char(100) DEFAULT NULL,
  `path` char(100) NOT NULL,
  `hit` int(11) NOT NULL,
  `name` char(20) NOT NULL,
  `regist_day` char(100) NOT NULL,
  `import` char(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `faq`
--

INSERT INTO `faq` (`num`, `subject`, `content`, `file_name`, `path`, `hit`, `name`, `regist_day`, `import`) VALUES
(2, '\택배 \수령 \시�\��도 지정이 가능\한�\��요?', '\푸\드장\에서 출�\��된 \상품이 \택배\사로 \이관된 \이\후에는 <br>\r\n고�\��님의 주소�\��를 방문\하는 \택배 기사\님의 \이\동 \스케�\�� 및 물량 \등\에 \따\라 구체\적인 \수령 \시�\��이 결정됩\니다. <br>\r\n\r\n\따\라\서 주문 과정에서 \상품을 받을 \시�\��을 \따로 지정하는 것은 불�\��능\합\니다. <br>\r\n\r\n만약 \오\전 ~ \이�\� \오\후 중에 반드시 \필요한 \상품이\라�\�<br>\r\n\하루 \전날 \수령\하도�\�� 주문\한 \후, \냉장/\냉동 보�\��해주시기�\� 바랍니다. ', '20181103134801.jpg', '/testBBS/', 4, '관리\자', '18-11-03 (13:48)', ''),
(3, '배송비는 \얼마인가요?', '\푸\드장\의 \상품을 5만원 \이\상 구매\하시면 무�\���\�� 배송\이 가능\하며, <br>\r\n5만원 \이\하 주문\은 배송비 3,000\원이 부과\됩\니다. <br>\r\n\r\n\또한 고�\��님의 \상품들\은 \아이\스박스 \안에 \아이\스\팩�\� \드라\이\아이\스 \등\을 <br>\r\n충�\��히 \동�\��하여 최대한 \안전하�\�� 보내\드리\니 참�\��해주시기 바랍니다. <br>', '20181103134956.jpg', '/testBBS/', 3, '관리\자', '18-11-03 (13:49)', ''),
(4, '\어\느 \택배\사로 보내\시나요?', '\푸\드장\은 배송\의 \신속함�\� \상황 추적의 \편리성 및 \신뢰\도 \등\을 고려\하여 <br>\r\n\r\n\우체국 \택배�\� \이\용\하여 \상품을 보내\드리고 \있습\니다. <br>\r\n\r\n\r\n\r\n\상품 출�\�� \작업시 <br>\r\n\r\n고�\��님�\�� 문자�\��세지�\�� \송\장번호�\� 발송\하며, <br>\r\n\r\n\r\n\r\n문자 \수신한 \날 \늦\은 \저녁�\��터 배송 추적이 가능\함\을 \안내\드립\니다.', '20181103135036.jpg', '/testBBS/', 5, '관리\자', '18-11-03 (13:50)', '');

-- --------------------------------------------------------

--
-- 테이블 구조 `goods`
--

CREATE TABLE `goods` (
  `goods_name` char(20) NOT NULL,
  `num` int(20) NOT NULL,
  `subject` char(100) NOT NULL,
  `side_subject` char(100) NOT NULL,
  `price` int(20) NOT NULL,
  `price_result` int(20) NOT NULL,
  `quantity` char(20) NOT NULL,
  `goods` char(20) NOT NULL,
  `file_name` char(40) NOT NULL,
  `hit` int(11) NOT NULL,
  `sale` int(11) NOT NULL,
  `DateTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `goods`
--

INSERT INTO `goods` (`goods_name`, `num`, `subject`, `side_subject`, `price`, `price_result`, `quantity`, `goods`, `file_name`, `hit`, `sale`, `DateTime`) VALUES
('ABC-20181123142204', 0, '\테스\트2', '\테스\트', 6000, 3000, '20', 'ABC', '1000000959_detail_054.jpg', 10, 50, '2019-01-16 11:28:03'),
('ABC-20181115175706', 5, '\듀�\�� \삼겹살 500g', '쫄�\���\���\��한 \살코기\와 부드러\운 \육질이', 6500, 5900, '20', 'ABC', '1000001212_detail_045.jpg', 59, 9, '2018-11-25 17:01:36'),
('ABC-20181115175825', 6, '\대패\삼겹살 500g x 4\팩', '\삼겹살\을 2mm로, \대패\삼겹살로 즐겨', 24400, 21960, '20', 'ABC', '1000000776_detail_073.jpg', 58, 10, '2019-01-16 11:28:07'),
('ABC-20181115182953', 7, '\소�\��기 \장조림\용 300g', '지방\이 \적은 \살코기�\� \얇�\��저며 \육\향\이', 6200, 5890, '20', 'ABC', '1000001308_detail_0100.jpg', 54, 5, '2019-01-16 11:28:37'),
('ABC-20181115184809', 8, '[eat cook] \냉장 \스\테이\크 +', '\어\디서나 간편\하�\�� \스\테이\크 \세\트로 \테', 15500, 13900, '30', 'ABC', '1000000906_detail_047.jpg', 169, 10, '2019-04-19 07:02:51'),
('ABC-20181115190238', 9, '[eat cook] \냉장 부�\��살 찹스', '\싱\싱\한 \자연\산 \훈제 \홍연\어~ \풍미가득', 12700, 12700, '30', 'ABC', '1000000911_detail_059.jpg', 145, 0, '2019-01-16 11:28:56');

-- --------------------------------------------------------

--
-- 테이블 구조 `member`
--

CREATE TABLE `member` (
  `id` char(20) NOT NULL,
  `pass` char(20) NOT NULL,
  `name` char(20) NOT NULL,
  `email` char(20) NOT NULL,
  `phone` char(20) NOT NULL,
  `address` char(20) DEFAULT NULL,
  `home` char(20) DEFAULT NULL,
  `address1` char(20) DEFAULT NULL,
  `point` int(11) DEFAULT NULL,
  `day` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `member`
--

INSERT INTO `member` (`id`, `pass`, `name`, `email`, `phone`, `address`, `home`, `address1`, `point`, `day`) VALUES
('123', '12345678', '\윤\영미', 'asdfasdfsadf', '123', '', '123', '\행복기숙사', NULL, 14),
('1234', '12345678', '\윤\영미', 'asdfasdf', '123', '', '123', '\행복기숙사', NULL, 14),
('aaa123', '12345678', '\윤', '123234', '123', '', '123', '', NULL, 0),
('aaaa1111', '12345678', '\윤', 'maie421', '123', '', '123', '', NULL, NULL),
('admin', 'admin', '관리\자', '123', '123', NULL, NULL, NULL, NULL, NULL),
('d', '12345678', 'd', 'd', 'd', '', 'd', '123', NULL, 12),
('maie421', '12345678', '\윤\영미', '123', '123', '', '', '', NULL, NULL),
('maie4444', '12345678', '\윤', '\ㄴ\ㅇ', '\ㅇㄹ', '', '', '', NULL, 0),
('naver_95785994', '', '\윤\영미', '', '', NULL, NULL, NULL, NULL, 0);

-- --------------------------------------------------------

--
-- 테이블 구조 `notice`
--

CREATE TABLE `notice` (
  `num` int(11) NOT NULL,
  `subject` char(100) NOT NULL,
  `content` char(100) NOT NULL,
  `file_name` char(100) DEFAULT NULL,
  `path` char(100) NOT NULL,
  `hit` int(11) NOT NULL,
  `name` char(20) NOT NULL,
  `regist_day` char(100) NOT NULL,
  `import` char(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `notice`
--

INSERT INTO `notice` (`num`, `subject`, `content`, `file_name`, `path`, `hit`, `name`, `regist_day`, `import`) VALUES
(13, '배송\사 변경 \안내', '', '2018 부산 \잡 \페스\티벌 \포\스\터.jpg', './img/menu', 24, '관리\자', '18-11-11 (12:17)', ''),
(14, '123', '123', '', './img/menu', 3, '관리\자', '18-12-18 (09:45)', '');

-- --------------------------------------------------------

--
-- 테이블 구조 `payment`
--

CREATE TABLE `payment` (
  `day` char(20) NOT NULL,
  `number` char(20) NOT NULL,
  `name` char(12) NOT NULL,
  `item_name` char(40) NOT NULL COMMENT '주문상품',
  `id` char(30) NOT NULL,
  `num` int(20) NOT NULL COMMENT '주문수',
  `Recipient` char(20) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `payment`
--

INSERT INTO `payment` (`day`, `number`, `name`, `item_name`, `id`, `num`, `Recipient`) VALUES
('18-11-22', '181122143055', 'ABD-20181115', '\훈제 \홍 \연\어 85g', 'id_181122143055', 1, ''),
('18-11-22', '181122143055', '', '', 'id_181122143055', 1, ''),
('18-11-22', '181122143110', 'ABC-20181115', '[eat cook] \냉장 부�\��살 찹스', 'id_181122143110', 1, ''),
('18-11-22', '181122143110', '', '', 'id_181122143110', 1, ''),
('18-11-22', '181122143151', 'ABD-20181122', '\테스\트', 'id_181122143151', 1, ''),
('18-11-22', '181122143151', '', '', 'id_181122143151', 1, ''),
('18-11-22', '181122143650', 'ABC-20181115', '[eat cook] \냉장 \스\테이\크 +', 'id_181122143650', 1, ''),
('18-11-23', '181123103606', 'ABC-20181115', '\소�\��기 \장조림\용 300g', 'id_181123103606', 1, ''),
('18-11-23', '181123103606', '', '', 'id_181123103606', 1, ''),
('18-11-23', '181123135120', 'ABC-20181115', '[eat cook] \냉장 \스\테이\크 +', 'id_181123135120', 1, ''),
('18-11-23', '181123135147', 'ABC-20181115', '[eat cook] \냉장 부�\��살 찹스', 'id_181123135147', 1, ''),
('18-11-23', '181123135759', 'ABC-20181115', '[eat cook] \냉장 \스\테이\크 +', 'id_181123135759', 1, ''),
('18-11-23', '181123142329', 'ABC-20181115', '[eat cook] \냉장 \스\테이\크 +', 'naver_95785994', 1, ''),
('18-11-23', '181123142406', 'ABC-20181115', '\듀�\�� \삼겹살 500g', 'id_181123142406', 1, ''),
('18-11-24', '181124160846', '', '\대패\삼겹살 500g x 4\팩', 'id_181124160846', 1, ''),
('18-11-24', '181124160846', '', '', 'id_181124160846', 1, ''),
('18-11-24', '181124160859', '', '\대패\삼겹살 500g x 4\팩', 'id_181124160859', 1, ''),
('18-11-24', '181124160859', '', '', 'id_181124160859', 1, ''),
('18-11-24', '181124161446', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161446', 1, ''),
('18-11-24', '181124161446', '', '', 'id_181124161446', 1, ''),
('18-11-24', '181124161455', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161455', 1, ''),
('18-11-24', '181124161455', '', '', 'id_181124161455', 1, ''),
('18-11-24', '181124161527', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161527', 1, ''),
('18-11-24', '181124161527', '', '', 'id_181124161527', 1, ''),
('18-11-24', '181124161651', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161651', 1, ''),
('18-11-24', '181124161651', '', '', 'id_181124161651', 1, ''),
('18-11-24', '181124161658', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161658', 1, ''),
('18-11-24', '181124161658', '', '', 'id_181124161658', 1, ''),
('18-11-24', '181124161817', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161817', 1, ''),
('18-11-24', '181124161817', '', '', 'id_181124161817', 1, ''),
('18-11-24', '181124161836', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161836', 1, ''),
('18-11-24', '181124161836', '', '', 'id_181124161836', 1, ''),
('18-11-24', '181124161921', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161921', 1, ''),
('18-11-24', '181124161921', '', '', 'id_181124161921', 1, ''),
('18-11-24', '181124161930', '', '\대패\삼겹살 500g x 4\팩', 'id_181124161930', 1, ''),
('18-11-24', '181124161930', '', '', 'id_181124161930', 1, ''),
('18-11-24', '181124161945', '', '\테스\트\입니다', 'id_181124161945', 1, ''),
('18-11-24', '181124161945', '', '', 'id_181124161945', 1, ''),
('18-11-24', '181124162228', '', '\소�\��기 \장조림\용 300g', 'id_181124162228', 1, ''),
('18-11-24', '181124162256', '', '[eat cook] \냉장 부�\��살 찹스', 'id_181124162256', 1, ''),
('18-11-24', '181124162256', '', '', 'id_181124162256', 1, ''),
('18-11-24', '181124162256', '', '', 'id_181124162256', 1, ''),
('18-11-25', '181125222204', 'ABD-20181122', '\훈제 \홍 \연\어 85g', 'id_181125222204', 1, ''),
('18-11-25', '181125222225', '', '\훈제 \홍 \연\어 85g', 'id_181125222225', 1, ''),
('18-11-25', '181125222225', '', '', 'id_181125222225', 1, ''),
('18-11-25', '181125222259', '', '\테스\트2', 'id_181125222259', 1, ''),
('18-11-25', '181125222259', '', '', 'id_181125222259', 1, ''),
('18-11-25', '181125222341', '', '\대패\삼겹살 500g x 4\팩', 'id_181125222341', 1, ''),
('18-11-25', '181125222557', '', '\테스\트\입니다', 'id_181125222557', 1, ''),
('18-11-25', '181125222635', '', '\테스\트\입니다', 'id_181125222635', 1, ''),
('18-11-25', '181125222743', '', '\테스\트\입니다', 'id_181125222743', 1, ''),
('18-11-25', '181125222934', '', '\테스\트\입니다', 'id_181125222934', 1, ''),
('18-11-25', '181125222943', '', '\테스\트\입니다', 'id_181125222943', 1, ''),
('18-11-25', '181125223037', '', '\테스\트\입니다', 'id_181125223037', 1, ''),
('18-11-25', '181125223042', 'ABD-20181123', '\테스\트\입니다', 'id_181125223042', 1, ''),
('18-11-25', '181125223055', 'ABD-20181123', '\테스\트\입니다', 'id_181125223055', 1, ''),
('18-11-25', '181125223133', 'ABC-20181115', '[eat cook] \냉장 \스\테이\크 +', 'id_181125223133', 1, ''),
('18-11-25', '181125223141', 'ABC-20181115', '[eat cook] \냉장 \스\테이\크 +', 'id_181125223141', 1, ''),
('18-11-25', '181125223344', 'ABC-20181115', '[eat cook] \냉장 부�\��살 찹스', 'id_181125223344', 1, ''),
('18-11-25', '181125223427', 'ABC-20181115', '\대패\삼겹살 500g x 4\팩', 'id_181125223427', 1, ''),
('18-11-25', '181125223443', 'ABD-20181122', '\테스\트', 'id_181125223443', 1, ''),
('18-11-26', '181126013117', 'ABD-20181123', '\테스\트\입니다', 'id_181126013117', 1, ''),
('18-11-26', '181126013117', '', '', 'id_181126013117', 1, ''),
('18-11-26', '181126013132', 'ABC-20181115', '[eat cook] \냉장 \스\테이\크 +', 'id_181126013132', 1, ''),
('18-11-26', '181126013132', '', '', 'id_181126013132', 1, ''),
('18-11-26', '181126013213', 'ABD-20181115', '\노르웨\이고등\어 400g \이\상 (3\입)', 'id_181126013213', 1, ''),
('18-11-26', '181126013213', '', '', 'id_181126013213', 1, ''),
('18-11-26', '181126013227', 'ABC-20181115', '[eat cook] \냉장 부�\��살 찹스', 'id_181126013227', 1, ''),
('18-11-26', '181126013227', '', '', 'id_181126013227', 1, ''),
('18-11-26', '181126013305', 'ABD-20181123', '\테스\트\입니다', 'id_181126013305', 1, ''),
('18-11-26', '181126013305', '', '', 'id_181126013305', 1, ''),
('18-11-26', '181126013317', 'ABC-20181115', '\소�\��기 \장조림\용 300g', 'id_181126013317', 1, ''),
('18-11-26', '181126013343', 'ABC-20181115', '\대패\삼겹살 500g x 4\팩', 'id_181126013343', 1, ''),
('18-11-26', '181126013343', '', '', 'id_181126013343', 1, ''),
('18-11-26', '181126020220', 'ABC-20181123', '\테스\트2', 'id_181126020220', 1, ''),
('18-11-26', '181126020220', '', '', 'id_181126020220', 1, ''),
('18-11-26', '181126020232', 'ABD-20181115', '\노르웨\이고등\어 400g \이\상 (3\입)', 'id_181126020232', 1, ''),
('18-11-26', '181126094630', 'ABC-20181115', '[eat cook] \냉장 \스\테이\크 +', 'id_181126094630', 1, ''),
('18-11-26', '181126094630', '', '', 'id_181126094630', 1, '');

-- --------------------------------------------------------

--
-- 테이블 구조 `side`
--

CREATE TABLE `side` (
  `goods_name` char(20) NOT NULL,
  `num` int(11) NOT NULL,
  `subject` char(20) NOT NULL,
  `side_subject` char(20) NOT NULL,
  `price` int(20) NOT NULL,
  `price_result` int(20) NOT NULL,
  `quantity` int(20) NOT NULL,
  `goods` char(20) NOT NULL,
  `file_name` char(40) NOT NULL,
  `hit` int(11) NOT NULL,
  `sale` int(11) DEFAULT NULL,
  `DateTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `side`
--

INSERT INTO `side` (`goods_name`, `num`, `subject`, `side_subject`, `price`, `price_result`, `quantity`, `goods`, `file_name`, `hit`, `sale`, `DateTime`) VALUES
('ABD-20181115175029', 4, '\노르웨\이고등\어 400g \이\상 (3\입)', '\통\통\하�\�� \살\이 \오�\� 고등\어\는 고유의', 4800, 4800, 20, 'ABD', '1000001252_detail_090.jpg', 86, 0, '2019-04-19 07:03:02'),
('ABD-20181115175137', 5, '\훈제 \홍 \연\어 85g', '\싱\싱\한 \자연\산 \훈제 \홍연\어~ \풍미가득', 9800, 4900, 20, 'ABD', '1000001085_detail_036.jpg', 71, 50, '2018-11-25 17:01:20'),
('ABD-20181122000514', 6, '\테스\트', '\테스\트\입니다', 3000, 2000, 10, 'ABD', '1000000854_detail_023.jpg', 57, 33, '2019-04-18 15:35:17');

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `faq`
--
ALTER TABLE `faq`
  ADD PRIMARY KEY (`num`);

--
-- 테이블의 인덱스 `goods`
--
ALTER TABLE `goods`
  ADD PRIMARY KEY (`num`);

--
-- 테이블의 인덱스 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`id`);

--
-- 테이블의 인덱스 `notice`
--
ALTER TABLE `notice`
  ADD PRIMARY KEY (`num`);

--
-- 테이블의 인덱스 `side`
--
ALTER TABLE `side`
  ADD PRIMARY KEY (`num`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `faq`
--
ALTER TABLE `faq`
  MODIFY `num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 테이블의 AUTO_INCREMENT `notice`
--
ALTER TABLE `notice`
  MODIFY `num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- 테이블의 AUTO_INCREMENT `side`
--
ALTER TABLE `side`
  MODIFY `num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
